# GetJournalData Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExecutedEventArgs..::..GetJournalData Method
ExecutedEventArgs Class See Also
---
Gets the journal data associated to this command (on journal playback).
**Namespace:** Autodesk.Revit.UI.Events**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public IDictionary<string, string> GetJournalData()
```

Visual Basic
---
```text
Public Function GetJournalData As IDictionary(Of String, String)
```

Visual C++
---
```text
public:
IDictionary<String^, String^>^ GetJournalData()
```

# Remarks
For details about the use of journal data associated to a command, see ExternalCommandData.JournalData.
# See Also
ExecutedEventArgs Class
Autodesk.Revit.UI.Events Namespace